#### Terraform Plan for live environment 📖 `success`

**_N.B. This plan doesn't reflect changes to the lambda source._**

<details><summary>Show Plan</summary>

```

random_password.end_of_day_username: Refreshing state... [id=none]
random_password.end_of_day_password: Refreshing state... [id=none]
aws_cloudwatch_event_rule.match_fee_schedule: Refreshing state... [id=live-match-fee-transfer-schedule]
aws_dynamodb_table.token: Refreshing state... [id=token]
aws_dynamodb_table.config: Refreshing state... [id=config]
aws_sqs_queue.transactions_dlq: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/755836339707/live-transactions-dlq.fifo]
aws_api_gateway_rest_api.api: Refreshing state... [id=9d7wigd9k0]
aws_dynamodb_table.audit: Refreshing state... [id=live-audit]
aws_cloudwatch_event_rule.refresh_tokens_schedule: Refreshing state... [id=live-refresh-tokens-schedule]
aws_iam_role.end_of_day_endpoint_lambda_iam_role: Refreshing state... [id=end-of-day-lambda-role-20220603111510713100000001]
aws_iam_role.end_of_day_lambda_iam_role: Refreshing state... [id=end-of-day-lambda-role-20220522195131837700000002]
aws_iam_role.queue_processor_lambda_iam_role: Refreshing state... [id=queue-processor-lambda-role-20220522195131837600000001]
aws_iam_role.lambda_iam_role: Refreshing state... [id=common-lambda-role-20220522195131837800000004]
aws_iam_role.match_fee_lambda_iam_role: Refreshing state... [id=match-fee-lambda-role-20220522195132826800000006]
aws_iam_policy.endpoint_logging_policy: Refreshing state... [id=arn:aws:iam::755836339707:policy/live/lambda/common-lambda-logging-20220522195132784700000005]
aws_acm_certificate.api: Refreshing state... [id=arn:aws:acm:eu-west-2:755836339707:certificate/5f54120a-dd46-4652-857d-f0a796e8799d]
aws_sqs_queue.transactions: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/755836339707/live-transactions.fifo]
aws_iam_role_policy_attachment.end_of_day_endpoint_lambda_logs: Refreshing state... [id=end-of-day-lambda-role-20220603111510713100000001-20220603111511490000000003]
module.purge_endpoint.aws_api_gateway_resource.endpoint_resource: Refreshing state... [id=pyskzt]
module.sage_endpoint.aws_api_gateway_resource.endpoint_resource: Refreshing state... [id=q8yl1g]
module.end_of_day_endpoint.aws_api_gateway_resource.endpoint_resource: Refreshing state... [id=hdotd7]
module.sage_callback_endpoint.aws_api_gateway_resource.endpoint_resource: Refreshing state... [id=k0dzcm]
aws_iam_role_policy_attachment.end_of_day_lambda_logs: Refreshing state... [id=end-of-day-lambda-role-20220522195131837700000002-20220522195135221500000007]
aws_lambda_function.process_end_of_day_lambda: Refreshing state... [id=live-end-of-day-processor]
aws_lambda_function.refresh_token_lambda: Refreshing state... [id=live-refresh-tokens-schedule]
aws_iam_role_policy_attachment.match_fee_lambda_logs: Refreshing state... [id=match-fee-lambda-role-20220522195132826800000006-2022052219513658280000000a]
aws_lambda_function.match_fee_lambda: Refreshing state... [id=live-match-fee-transfer-schedule]
aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=common-lambda-role-20220522195131837800000004-20220522195135532200000009]
module.purge_endpoint.aws_lambda_function.endpoint_lambda: Refreshing state... [id=live-purge-unpaid-lambda]
module.sage_endpoint.aws_api_gateway_method.endpoint_method: Refreshing state... [id=agm-9d7wigd9k0-q8yl1g-GET]
module.purge_endpoint.aws_api_gateway_method.endpoint_method: Refreshing state... [id=agm-9d7wigd9k0-pyskzt-POST]
aws_lambda_function.process_transactions_sqs_lambda: Refreshing state... [id=live-transaction-sqs-lambda]
aws_iam_role_policy_attachment.queue_processor_lambda_logs: Refreshing state... [id=queue-processor-lambda-role-20220522195131837600000001-20220522195135233900000008]
aws_iam_policy.lambda_dynamo_policy: Refreshing state... [id=arn:aws:iam::755836339707:policy/live/lambda/common-lambda-dynamo-policy-2022052219514030170000000b]
aws_iam_policy.lambda_audit_dynamo_policy: Refreshing state... [id=arn:aws:iam::755836339707:policy/live/lambda/audit-lambda-dynamo-policy-2022052219514030170000000c]
time_sleep.wait_60_seconds: Refreshing state... [id=2022-05-22T19:52:57Z]
aws_dynamodb_table_item.config: Refreshing state... [id=config|id||live|]
aws_route53_record.api_certificate_validation["api.accounting.mersthamcc.co.uk"]: Refreshing state... [id=Z047058117NM6D6MGKBNH__a438fda6ab65c1cc4dd2220a53c55bd8.api.accounting.mersthamcc.co.uk._CNAME]
module.end_of_day_endpoint.aws_api_gateway_method.endpoint_method: Refreshing state... [id=agm-9d7wigd9k0-hdotd7-POST]
module.sage_callback_endpoint.aws_api_gateway_method.endpoint_method: Refreshing state... [id=agm-9d7wigd9k0-k0dzcm-GET]
aws_iam_role_policy_attachment.queue_processor_lambda_dynamo: Refreshing state... [id=queue-processor-lambda-role-20220522195131837600000001-2022052219514244750000000e]
aws_iam_role_policy_attachment.end_of_day_endpoint_lambda_dynamo: Refreshing state... [id=end-of-day-lambda-role-20220603111510713100000001-20220603111511473500000002]
aws_iam_role_policy_attachment.end_of_day_lambda_dynamo: Refreshing state... [id=end-of-day-lambda-role-20220522195131837700000002-20220522195143494700000011]
aws_iam_role_policy_attachment.lambda_dynamo: Refreshing state... [id=common-lambda-role-20220522195131837800000004-2022052219514244880000000f]
aws_iam_role_policy_attachment.match_fee_lambda_dynamo: Refreshing state... [id=match-fee-lambda-role-20220522195132826800000006-2022052219514243800000000d]
aws_iam_role_policy_attachment.queue_processor_lambda_audit_dynamo: Refreshing state... [id=queue-processor-lambda-role-20220522195131837600000001-20220522195143481500000010]
aws_sqs_queue_policy.process_transactions_queue_policy: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/755836339707/live-transactions.fifo]
aws_cloudwatch_log_group.process_end_of_day_lambda_log_group: Refreshing state... [id=/aws/lambda/live-end-of-day-processor]
module.end_of_day_endpoint.aws_lambda_function.endpoint_lambda: Refreshing state... [id=live-end-of-day-lambda]
aws_iam_policy.invoke_processor_policy: Refreshing state... [id=arn:aws:iam::755836339707:policy/live/lambda/invoke-processor-20220603111518310000000004]
aws_acm_certificate_validation.api: Refreshing state... [id=2022-05-22 19:52:11.669 +0000 UTC]
aws_lambda_permission.allow_cloudwatch_to_call_refresh_tokens_lambda: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.refresh_tokens_schedule_target: Refreshing state... [id=live-refresh-tokens-schedule-6]
aws_cloudwatch_log_group.refresh_token_lambda_log_group: Refreshing state... [id=/aws/lambda/live-refresh-tokens-schedule]
module.purge_endpoint.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/live-purge-unpaid-lambda]
module.purge_endpoint.aws_api_gateway_integration.endpoint_integration: Refreshing state... [id=agi-9d7wigd9k0-pyskzt-POST]
module.purge_endpoint.aws_lambda_permission.endpoint_execution_permission: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_cloudwatch_log_group.match_fee_lambda_log_group: Refreshing state... [id=/aws/lambda/live-match-fee-transfer-schedule]
aws_cloudwatch_event_target.match_fee_schedule_target: Refreshing state... [id=live-match-fee-transfer-schedule-6]
aws_lambda_permission.allow_cloudwatch_to_call_match_fee_lambda: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_iam_role_policy_attachment.end_of_day_endpoint_lambda_invoke: Refreshing state... [id=end-of-day-lambda-role-20220603111510713100000001-20220603111518569300000005]
aws_lambda_event_source_mapping.lambda_sqs_mapping: Refreshing state... [id=990e1d50-f91c-4bff-bbec-a614e13dc219]
aws_cloudwatch_log_group.sqs_transactions_log_group: Refreshing state... [id=/aws/lambda/live-transaction-sqs-lambda]
aws_api_gateway_domain_name.api: Refreshing state... [id=api.accounting.mersthamcc.co.uk]
module.sage_callback_endpoint.aws_lambda_function.endpoint_lambda: Refreshing state... [id=live-sage-callback-lambda]
module.sage_endpoint.aws_lambda_function.endpoint_lambda: Refreshing state... [id=live-sage-lambda]
aws_route53_record.api: Refreshing state... [id=Z047058117NM6D6MGKBNH_api.accounting.mersthamcc.co.uk_A]
module.end_of_day_endpoint.aws_lambda_permission.endpoint_execution_permission: Refreshing state... [id=AllowAPIGatewayInvoke]
module.end_of_day_endpoint.aws_api_gateway_integration.endpoint_integration: Refreshing state... [id=agi-9d7wigd9k0-hdotd7-POST]
module.end_of_day_endpoint.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/live-end-of-day-lambda]
aws_cloudwatch_log_metric_filter.transaction_processing_success_metric: Refreshing state... [id=live-transaction-processing-success]
aws_cloudwatch_log_metric_filter.transaction_processing_missing_tender_metric: Refreshing state... [id=live-transaction-processing-missing-tender-warning]
aws_cloudwatch_log_metric_filter.transaction_processing_error_metric: Refreshing state... [id=live-transaction-processing-errors]
aws_cloudwatch_log_metric_filter.transaction_processing_skip_metric: Refreshing state... [id=live-transaction-processing-skips]
module.sage_callback_endpoint.aws_api_gateway_integration.endpoint_integration: Refreshing state... [id=agi-9d7wigd9k0-k0dzcm-GET]
module.sage_callback_endpoint.aws_lambda_permission.endpoint_execution_permission: Refreshing state... [id=AllowAPIGatewayInvoke]
module.sage_callback_endpoint.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/live-sage-callback-lambda]
module.sage_endpoint.aws_api_gateway_integration.endpoint_integration: Refreshing state... [id=agi-9d7wigd9k0-q8yl1g-GET]
module.sage_endpoint.aws_lambda_permission.endpoint_execution_permission: Refreshing state... [id=AllowAPIGatewayInvoke]
module.sage_endpoint.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/live-sage-lambda]
aws_api_gateway_deployment.deployment: Refreshing state... [id=4wbnj8]
aws_api_gateway_stage.api_stage: Refreshing state... [id=ags-9d7wigd9k0-live]
aws_api_gateway_base_path_mapping.api: Refreshing state... [id=api.accounting.mersthamcc.co.uk/]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_cloudwatch_log_group.process_end_of_day_lambda_log_group has changed
  ~ resource "aws_cloudwatch_log_group" "process_end_of_day_lambda_log_group" {
        id                = "/aws/lambda/live-end-of-day-processor"
        name              = "/aws/lambda/live-end-of-day-processor"
      + tags              = {}
        # (3 unchanged attributes hidden)
    }

  # aws_iam_policy.invoke_processor_policy has changed
  ~ resource "aws_iam_policy" "invoke_processor_policy" {
        id          = "arn:aws:iam::755836339707:policy/live/lambda/invoke-processor-20220603111518310000000004"
        name        = "invoke-processor-20220603111518310000000004"
      + tags        = {}
        # (7 unchanged attributes hidden)
    }

  # aws_iam_role.end_of_day_endpoint_lambda_iam_role has changed
  ~ resource "aws_iam_role" "end_of_day_endpoint_lambda_iam_role" {
        id                    = "end-of-day-lambda-role-20220603111510713100000001"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::755836339707:policy/live/lambda/common-lambda-dynamo-policy-2022052219514030170000000b",
          + "arn:aws:iam::755836339707:policy/live/lambda/common-lambda-logging-20220522195132784700000005",
          + "arn:aws:iam::755836339707:policy/live/lambda/invoke-processor-20220603111518310000000004",
        ]
        name                  = "end-of-day-lambda-role-20220603111510713100000001"
      + tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lambda_event_source_mapping.lambda_sqs_mapping has changed
  ~ resource "aws_lambda_event_source_mapping" "lambda_sqs_mapping" {
      + function_response_types            = []
        id                                 = "990e1d50-f91c-4bff-bbec-a614e13dc219"
      + queues                             = []
      + topics                             = []
        # (15 unchanged attributes hidden)
    }

  # aws_lambda_function.process_end_of_day_lambda has changed
  ~ resource "aws_lambda_function" "process_end_of_day_lambda" {
        id                             = "live-end-of-day-processor"
      + layers                         = []
      + tags                           = {}
        # (21 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_sqs_queue.transactions has changed
  ~ resource "aws_sqs_queue" "transactions" {
        id                                = "https://sqs.eu-west-2.amazonaws.com/755836339707/live-transactions.fifo"
        name                              = "live-transactions.fifo"
      + policy                            = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sqs:SendMessage",
                          + "sqs:GetQueueAttributes",
                          + "sqs:ChangeMessageVisibility",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::755836339707:role/live/lambda/end-of-day-lambda-role-20220522195131837700000002",
                              + "arn:aws:iam::755836339707:role/live/lambda/match-fee-lambda-role-20220522195132826800000006",
                            ]
                        }
                      + Resource  = "arn:aws:sqs:eu-west-2:755836339707:live-transactions.fifo"
                      + Sid       = "SendSQS"
                    },
                  + {
                      + Action    = [
                          + "sqs:ReceiveMessage",
                          + "sqs:GetQueueAttributes",
                          + "sqs:DeleteMessage",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::755836339707:role/live/lambda/queue-processor-lambda-role-20220522195131837600000001"
                        }
                      + Resource  = "arn:aws:sqs:eu-west-2:755836339707:live-transactions.fifo"
                      + Sid       = "ReceiveSQS"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                              = {}
        # (15 unchanged attributes hidden)
    }

  # aws_sqs_queue.transactions_dlq has changed
  ~ resource "aws_sqs_queue" "transactions_dlq" {
        id                                = "https://sqs.eu-west-2.amazonaws.com/755836339707/live-transactions-dlq.fifo"
        name                              = "live-transactions-dlq.fifo"
      + redrive_allow_policy              = jsonencode(
            {
              + redrivePermission = "allowAll"
            }
        )
      + tags                              = {}
        # (14 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.audit_dynamo_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "audit_dynamo_policy_document"  {
      ~ id      = "3403348380" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:BatchWriteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:eu-west-2:755836339707:table/live-audit"
                      - Sid      = "AllowAccessToDynamoTables"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              ~ (known after apply),
                # (1 unchanged element hidden)
            ]
            # (3 unchanged attributes hidden)
        }
    }

  # aws_dynamodb_table.error will be created
  + resource "aws_dynamodb_table" "error" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "live-error"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "Application" = "accounts-api"
          + "Environment" = "live"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "id"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

  # aws_iam_policy.lambda_audit_dynamo_policy will be updated in-place
  ~ resource "aws_iam_policy" "lambda_audit_dynamo_policy" {
        id          = "arn:aws:iam::755836339707:policy/live/lambda/audit-lambda-dynamo-policy-2022052219514030170000000c"
        name        = "audit-lambda-dynamo-policy-2022052219514030170000000c"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:BatchWriteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:eu-west-2:755836339707:table/live-audit"
                      - Sid      = "AllowAccessToDynamoTables"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (6 unchanged attributes hidden)
    }

  # aws_sqs_queue.transactions_dlq will be updated in-place
  ~ resource "aws_sqs_queue" "transactions_dlq" {
        id                                = "https://sqs.eu-west-2.amazonaws.com/755836339707/live-transactions-dlq.fifo"
        name                              = "live-transactions-dlq.fifo"
      - redrive_allow_policy              = jsonencode(
            {
              - redrivePermission = "allowAll"
            }
        ) -> null
        tags                              = {}
        # (14 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>